#include <string.h>
#include "diksamc.h"

ErrorDefinition dkc_error_message_format[] = {
    {"dummy"},
    {"在($(token))附近发生语法错误"},
    {"不正确的字符($(bad_char))"},
    {"函数名重复($(name))"},
    {"不正确的多字节字符。"},
    {"预期外的宽字符串。"},
    {"函数的参数名重复($(name))。"},
    {"变量名$(name)重复。"},
    {"找不到变量或函数$(name)。"},
    {"不能强制转型为派生类型。"},
    {"不能将$(src)转型为$(dest)。"},
    {"算数运算符的操作数类型不正确。"},
    {"比较运算符的操作数类型不正确。"},
    {"逻辑and/or运算符的操作数类型不正确。"},
    {"减法运算符的操作数类型不正确。"},
    {"逻辑非运算符的操作数类型不正确。"},
    {"自增/自减运算符的操作数类型不正确。"},
    {"函数调用运算符的操作数不是函数名。"},
    {"找不到函数$(name)。"},
    {"函数的参数数量错误。"},
    {"赋值运算符的左边不是一个左边值。"},
    {"标签$(label)不存在。"},
    {"dummy"}
};
